-- -------------------------------------------------------------
-- TablePlus 26.10.22(802)
--
-- https://tableplus.com/
--
-- Database: onepiece_dev
-- Generation Time: 2026-10-28 22:26:01.0180
-- -------------------------------------------------------------


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


DROP TABLE IF EXISTS `chat_message`;
CREATE TABLE `chat_message` (
  `id` int NOT NULL AUTO_INCREMENT,
  `room` varchar(50) NOT NULL DEFAULT 'public' COMMENT '房间名',
  `username` varchar(50) NOT NULL COMMENT '发送者昵称',
  `content` text NOT NULL COMMENT '消息内容',
  `createTime` datetime(6) NOT NULL DEFAULT CURRENT_TIMESTAMP(6) COMMENT '发送时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=31 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

DROP TABLE IF EXISTS `todo`;
CREATE TABLE `todo` (
  `id` int NOT NULL AUTO_INCREMENT,
  `title` varchar(100) NOT NULL COMMENT '待办标题',
  `status` tinyint NOT NULL DEFAULT '0' COMMENT '状态: 0待办 1进行中 2已完成',
  `user_id` int NOT NULL COMMENT '所属用户',
  `createDate` datetime(6) NOT NULL DEFAULT CURRENT_TIMESTAMP(6) COMMENT '创建时间',
  `updateDate` datetime(6) NOT NULL DEFAULT CURRENT_TIMESTAMP(6) ON UPDATE CURRENT_TIMESTAMP(6) COMMENT '更新时间',
  `is_important` tinyint NOT NULL DEFAULT '0' COMMENT '是否重要 0-不重要 1-重要',
  `is_urgent` tinyint NOT NULL DEFAULT '0' COMMENT '是否紧急 0-不紧急 1-紧急',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=70 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `id` int NOT NULL AUTO_INCREMENT,
  `password` varchar(50) NOT NULL COMMENT '密码',
  `age` int DEFAULT NULL,
  `phone` varchar(11) DEFAULT NULL,
  `desc` text,
  `email` int DEFAULT NULL,
  `birthday` timestamp NULL DEFAULT NULL,
  `username` varchar(50) NOT NULL COMMENT '用户名',
  `createTime` datetime(6) NOT NULL DEFAULT CURRENT_TIMESTAMP(6) COMMENT '创建时间',
  `updateTime` datetime(6) NOT NULL DEFAULT CURRENT_TIMESTAMP(6) COMMENT '更新时间',
  `name` varchar(50) DEFAULT NULL COMMENT '角色姓名（中文常用名）',
  `japaneseName` varchar(50) DEFAULT NULL COMMENT '日文名',
  `epithet` varchar(100) DEFAULT NULL COMMENT '绰号/外号（如：草帽小子）',
  `gender` varchar(10) DEFAULT NULL COMMENT '性别',
  `height` int DEFAULT NULL COMMENT '身高（单位：cm）',
  `status` varchar(20) DEFAULT 'Alive' COMMENT '状态（Alive, Deceased, Unknown）',
  `affiliation` varchar(100) DEFAULT NULL COMMENT '所属组织/海贼团（如：草帽一伙）',
  `occupation` varchar(100) DEFAULT NULL COMMENT '职位/身份（如：船长，航海士）',
  `bounty` bigint DEFAULT NULL COMMENT '悬赏金（单位：贝里）',
  `devil_fruit` varchar(50) DEFAULT NULL COMMENT '恶魔果实能力名称',
  `dream` text COMMENT '梦想/目标',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

INSERT INTO `chat_message` (`id`, `room`, `username`, `content`, `createTime`) VALUES
(1, 'public', 'tester', 'hello from test', '2026-08-17 22:58:52.573554'),
(2, 'public', 'aaa', 'hello 我是', '2026-08-17 23:00:51.921770'),
(3, 'public', 'aaa', 'hello 我是aaa', '2026-08-17 23:00:57.408843'),
(4, 'public', 'bbb', '你好我是bbb', '2026-08-17 23:01:10.757095'),
(5, 'public', 'ccc', '我是吃吃吃', '2026-08-17 23:01:38.309562'),
(6, 'public', '呵呵', '你好', '2026-08-19 21:23:02.986828'),
(7, 'public', 'xixi', '你好吗', '2026-08-19 21:23:24.823867'),
(8, 'public', '呵呵', '我不好', '2026-08-19 21:23:30.879404'),
(9, 'public', 'xixi', 'hello', '2026-08-19 21:23:58.049092'),
(10, 'public', 'xixi', 'hello world', '2026-08-19 21:23:58.331868'),
(11, 'public', 'xixi', 'hello world', '2026-08-19 21:24:08.690465'),
(12, 'public', '李红', '我是李红', '2026-08-19 22:09:42.374409'),
(13, 'public', '张婉', '我是张婉', '2026-08-19 22:09:49.801155'),
(14, 'public', '张婉', '我真的是张婉', '2026-08-19 22:13:56.696071'),
(15, 'public', '张三', '我是张三', '2026-08-19 22:14:35.906492'),
(16, 'public', '李红', '你是张三我是什么', '2026-08-19 22:14:57.897080'),
(17, 'public', '李红', '我说', '2026-08-19 22:15:32.124319'),
(18, 'public', 'www', '我是', '2026-08-19 22:44:24.889700'),
(19, 'public', 'www', '我是www', '2026-08-19 22:44:25.211260'),
(20, 'public', 'qqq', '我是qqq', '2026-08-19 22:44:34.313159'),
(21, 'public', '123', '123', '2026-08-20 15:07:56.969633'),
(22, 'public', '456', '456', '2026-08-20 15:08:12.613319'),
(23, 'public', 'xx', 'xxx', '2026-08-20 16:27:02.700177'),
(24, 'public', 'yyy', 'yyyy', '2026-08-20 16:27:11.583313'),
(25, 'public', 'gggs', 'adad', '2026-08-21 10:36:26.414953'),
(26, 'public', 'gdsgsdg', '13413rgv', '2026-08-21 10:53:41.703846'),
(27, 'public', 'gdsgsdg', 'hello 我是 蒙奇', '2026-08-21 10:53:58.046688'),
(28, 'public', 'gdsgsdg', 'hello 我是 蒙奇 D 路飞', '2026-08-21 10:54:01.126902'),
(29, 'public', 'gdsgsdg', '的是非法所得 \n飒短发', '2026-08-21 10:54:09.746767'),
(30, 'public', 'youke33', '我是游客33', '2026-08-21 23:25:00.955131');

INSERT INTO `todo` (`id`, `title`, `status`, `user_id`, `createDate`, `updateDate`, `is_important`, `is_urgent`) VALUES
(1, '我是第一个', 1, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(2, '我是第二个', 1, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(4, '我是新的', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(5, '2.3635240115362404sdfsdf', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(6, '2.5544148388984667', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(7, '1.3999532116641626gsdgsdg', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(8, '0.6552093472849722sgds', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(9, '0.46615767191255786', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(10, '0.18277697595944076dg', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(11, '2.4971673507993355sdg', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(12, '0.8932768751009932g', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(13, '1.3858886740769172gs', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(14, '2.623858436019123sdgs', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(15, '1.668129228665656', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(16, '1.9191950202696821s', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(17, '1.3021369043707791', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(18, '1.6825562686894768', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(19, '1.6909583104337638f', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(20, '2.4048982311574427g', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(21, '1.8788206726211312j', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(22, '2.1792367314482326jjk', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(23, '2.175318138149632', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(24, '1.3724297592915473r', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(25, '1.083517657384363r', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(26, '0.4458888796738859rgt', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(27, '1.9582652128350189t', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(28, '0.2542601726884709t', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(29, '2.6904896696299563', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(30, '2.513122189454417rg', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(31, '1.0829509498327563g', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(32, '1.6662723626892326h', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(33, '2.9554627786489114', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(34, '0.6235769444505673', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(35, '1.1234966831129194', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(36, '1.95502399607243eg', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(37, '0.1266914903136238h', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(38, '0.5881171519612854', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(39, '0.33528578781009877', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(40, '1.9864446797161874eh', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(41, '1.5963861520958695', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(42, '0.09470705326630158h', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(43, '1.0374207004262952', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(44, '2.0857629685481927h', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(45, '2.8359928860796715h', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(46, '0.8734822355337171', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(47, '1.428172047012993eh', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(48, '0.02756304647092389', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(49, '0.4685556616177453he', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(50, '2.5363467957862795j', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(51, '0.6742244859181041j', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(52, '2.22151811277426', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(53, '2.095930306518128', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(54, '2.7919677948855277重启后的初始化效果 必须展开且没有过渡', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(55, '聚焦到楼层底部 按返回键 必须展开且没有过渡', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(56, '视频关闭后 切换二级导航 必须展开且没有过渡 视频关闭后 切换一级导航 必须展开且没有过渡视频关闭后 切换一级导航 必须展开且没有过渡', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(57, '历史组件流程图', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(58, '三享历史组件 历史组件', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(59, '0.5031145063709906能力是怎么来的 学习能力工作能力 就是你硬着头皮上做事做出来的', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(60, '能力是怎么来的 学习能力工作能力 就是你硬着头皮上做事做出来的', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(61, '长期主义的秘诀就是无视中断', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(62, '如果你的人生遇到了困难，日子是不会停下来让你处理的，接下来的生活还在继续。 你必须在面对新的困难的同时来解决遇到的这个困难， 你必须在遇到下一个挑战的时候解决上一个错误。', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(63, '编程能力无非就是 概念 + 代码，一个说一个敲。', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(64, '前端是数据逻辑 渲染逻辑 交互逻辑、 后端是数据校验 数据安全 数据存储', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(65, '能力是怎么来的 学习能力工作能力 就是你硬着头皮上做事做出来的', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(66, '大多数框架 需要学习一大堆概念，才能做出一个像样的项目。 这就是学习成本增加', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(67, '一个人的所有行为是由他的三观决定的，而一个人如何做事是由他的方法论决定的。我们应该多做事，在事上修行自己的三观，完善自己的方法论。', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(68, 'hh', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0),
(69, 'webpack vite rollup qiankun 算法', 0, 0, '2026-10-28 17:37:48.737862', '2026-10-28 17:37:49.189459', 0, 0);

INSERT INTO `user` (`id`, `password`, `age`, `phone`, `desc`, `email`, `birthday`, `username`, `createTime`, `updateTime`, `name`, `japaneseName`, `epithet`, `gender`, `height`, `status`, `affiliation`, `occupation`, `bounty`, `devil_fruit`, `dream`) VALUES
(1, '123456', 19, NULL, NULL, NULL, '2000-01-01 00:00:00', '', '2026-08-14 12:59:34.025013', '2026-08-14 13:00:05.331479', NULL, NULL, NULL, NULL, NULL, 'Alive', NULL, NULL, NULL, NULL, NULL),
(2, '1383734cc13db894a26e184e8e66da87', NULL, NULL, NULL, NULL, NULL, 'hello11', '2026-08-14 22:25:14.265929', '2026-08-14 22:25:14.265929', NULL, NULL, NULL, NULL, NULL, 'Alive', NULL, NULL, NULL, NULL, NULL),
(3, '1383734cc13db894a26e184e8e66da87', NULL, NULL, NULL, NULL, NULL, 'hello22', '2026-08-14 22:25:23.687240', '2026-08-14 22:25:23.687240', NULL, NULL, NULL, NULL, NULL, 'Alive', NULL, NULL, NULL, NULL, NULL),
(4, '1383734cc13db894a26e184e8e66da87', NULL, NULL, NULL, NULL, NULL, 'hello222', '2026-08-14 23:06:16.059778', '2026-08-14 23:06:16.059778', NULL, NULL, NULL, NULL, NULL, 'Alive', NULL, NULL, NULL, NULL, NULL),
(5, 'afdd0b4ad2ec172c586e2150770fbf9e', NULL, NULL, NULL, NULL, NULL, 'hello1234', '2026-08-14 23:40:03.247469', '2026-08-14 23:40:03.247469', NULL, NULL, NULL, NULL, NULL, 'Alive', NULL, NULL, NULL, NULL, NULL),
(6, 'e10adc3949ba59abbe56e057f20f883e', 19, NULL, NULL, NULL, '2000-05-05 00:00:00', '蒙奇·D·路飞', '2026-08-21 09:37:42.290888', '2026-08-21 09:37:42.290888', '蒙奇·D·路飞', NULL, '草帽小子', '男', 174, 'Alive', '草帽一伙', '船长', 1500000000, '橡胶果实', '成为海贼王'),
(7, 'e10adc3949ba59abbe56e057f20f883e', 21, NULL, NULL, NULL, '2000-11-11 00:00:00', '罗罗诺亚·索隆', '2026-08-21 09:37:42.323887', '2026-08-21 09:37:42.323887', '罗罗诺亚·索隆', NULL, '海贼猎人', '男', 181, 'Alive', '草帽一伙', '战斗员', 320000000, NULL, '成为世界第一大剑豪'),
(8, 'e10adc3949ba59abbe56e057f20f883e', 20, NULL, NULL, NULL, '2000-07-03 00:00:00', '娜美', '2026-08-21 09:37:42.351618', '2026-08-21 09:37:42.351618', '娜美', NULL, '小贼猫', '女', 170, 'Alive', '草帽一伙', '航海士', 66000000, NULL, '画出全世界的航海图'),
(9, 'e10adc3949ba59abbe56e057f20f883e', 19, NULL, NULL, NULL, '2000-04-01 00:00:00', '乌索普', '2026-08-21 09:37:42.381633', '2026-08-21 09:37:42.381633', '乌索普', NULL, '狙击之王', '男', 176, 'Alive', '草帽一伙', '狙击手', 200000000, NULL, '成为勇敢的海上战士'),
(10, 'e10adc3949ba59abbe56e057f20f883e', 21, NULL, NULL, NULL, '2000-03-02 00:00:00', '山治', '2026-08-21 09:37:42.413886', '2026-08-21 09:37:42.413886', '山治', NULL, '黑足', '男', 180, 'Alive', '草帽一伙', '厨师', 330000000, NULL, '找到传说之海 All Blue'),
(11, 'e10adc3949ba59abbe56e057f20f883e', 17, NULL, NULL, NULL, '2000-12-24 00:00:00', '托尼托尼·乔巴', '2026-08-21 09:37:42.441645', '2026-08-21 09:37:42.441645', '托尼托尼·乔巴', NULL, '爱吃棉花糖的乔巴', '男', 90, 'Alive', '草帽一伙', '船医', 1000, '人人果实', '成为能医治所有疾病的万能药'),
(12, 'e10adc3949ba59abbe56e057f20f883e', 30, NULL, NULL, NULL, '2000-02-06 00:00:00', '妮可·罗宾', '2026-08-21 09:37:42.470129', '2026-08-21 09:37:42.470129', '妮可·罗宾', NULL, '恶魔之子', '女', 188, 'Alive', '草帽一伙', '考古学家', 130000000, '花花果实', '找到真正的历史正文'),
(13, 'e10adc3949ba59abbe56e057f20f883e', 36, NULL, NULL, NULL, '2000-03-09 00:00:00', '弗兰奇', '2026-08-21 09:37:42.498660', '2026-08-21 09:37:42.498660', '弗兰奇', NULL, '铁人·弗兰奇', '男', 240, 'Alive', '草帽一伙', '船匠', 94000000, NULL, '乘着自己造的船到达世界尽头'),
(14, 'e10adc3949ba59abbe56e057f20f883e', 90, NULL, NULL, NULL, '2000-04-03 00:00:00', '布鲁克', '2026-08-21 09:37:42.769472', '2026-08-21 09:37:42.769472', '布鲁克', NULL, '灵魂之王', '男', 277, 'Alive', '草帽一伙', '音乐家', 83000000, '黄泉果实', '与鲸鱼拉布重逢'),
(15, 'e10adc3949ba59abbe56e057f20f883e', 46, NULL, NULL, NULL, '2000-04-02 00:00:00', '甚平', '2026-08-21 09:37:42.911953', '2026-08-21 09:37:42.911953', '甚平', NULL, '海侠', '男', 301, 'Alive', '草帽一伙', '舵手', 438000000, NULL, '实现鱼人族与人类的和平共处');



/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;